eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/абс_СвойстваОС/абс_СвойстваОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>абс_СвойстваОС</name>
  <type>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.абс_ТипыСтроений</types>
    <types>CatalogRef.МестаЭксплуатацииПоСооружению</types>
    <types>Boolean</types>
    <types>CatalogRef.ЦелиИспользования</types>
    <types>CatalogRef.абс_КатегорииЗемель</types>
    <types>CatalogRef.Подразделения</types>
    <types>EnumRef.абс_ТипКровли</types>
    <types>CatalogRef.Контрагенты</types>
    <types>String</types>
    <types>CatalogRef.Должности</types>
    <types>Date</types>
    <types>Number</types>
    <types>EnumRef.абс_АрендуемоеСобственное</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БухгалтерскаяИнформацияОбОбъектеНедвижимостиОфисныеЗдания</name>
      <description>Бухгалтерская информация</description>
      <code>000000111</code>
      </content>
        </content>
      </content>
      </content>
    </items>
    <items>
      <name>КоммерческаяИБухгалтерскаяИнформацияОСлужебномАвтомобили</name>
      <description>Коммерческая и бухгалтерская информация о служебном автомобили</description>
      <code>000000022</code>
      </content>
      </content>
    </items>
    <items>
      <name>КоммерческаяИнформацияОбОъектеНедвижимости</name>
      <description>Коммерческая информация</description>
      <code>000000110</code>
        </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ОбщаяИнформацияОбОбъектеНедвижимости</name>
      <description>Общая информация</description>
      <code>000000045</code>
      </content>
    </items>
    <items>
      <name>ОбщаяИнформацияОСлужебномАвтомобили</name>
      <description>Общая информация о служебном автомобили</description>
      <code>000000001</code>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПравоваяИнформацияОбОбъектеНедвижимости</name>
      <description>Правовая информация</description>
      <code>000000109</code>
    </items>
    <items>
      <name>ТехническаяИнформацияОбОбъектеНедвижимости</name>
      <description>Техническая информация</description>
      <code>000000064</code>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>РедактируетсяВТаблице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗемельныйУчасток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияЭТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияОфисы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗданияГаражи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияСвойствОС/абс_ЗначенияСвойствОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияСвойствОС</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.абс_СвойстваОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/СтоимостьОСБухгалтерскийУчет/СтоимостьОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьОСБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСобытийОС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентПересчета</name>
    <comment>Только для переоценки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ГруппыОС/ГруппыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыОС</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Здания</name>
  </enumValues>
  <enumValues>
    <name>Сооружения</name>
  </enumValues>
  <enumValues>
    <name>абс_СооруженияНедвижимость</name>
  </enumValues>
  <enumValues>
    <name>МашиныИОборудование</name>
  </enumValues>
  <enumValues>
    <name>ОфисноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйИХозяйственныйИнвентарь</name>
  </enumValues>
  <enumValues>
    <name>РабочийСкот</name>
  </enumValues>
  <enumValues>
    <name>ПродуктивныйСкот</name>
  </enumValues>
  <enumValues>
    <name>МноголетниеНасаждения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыПриродопользования</name>
  </enumValues>
  <enumValues>
    <name>ДругиеВидыОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеВложенияВАрендованноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ВычислительнаяТехника</name>
  </enumValues>
  <enumValues>
    <name>ПрочееИмуществоТребующееГосударственнойРегистрации</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОбъектовНевижимостиОС/абс_ВидыОбъектовНевижимостиОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОбъектовНевижимостиОС</name>
  <enumValues>
    <name>ОфисныеЗдания</name>
  </enumValues>
  <enumValues>
    <name>Гаражи</name>
  </enumValues>
  <enumValues>
    <name>ЭТЦ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/абс_СвойстваОС/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ЗаполнитьГруппуОСДляПодчиненных(Ссылка, СтруктураРеквизитов) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_СвойстваОС.Ссылка
	                      |ИЗ
	                      |	ПланВидовХарактеристик.абс_СвойстваОС КАК абс_СвойстваОС
	                      |ГДЕ
	                      |	абс_СвойстваОС.Ссылка В ИЕРАРХИИ(&Ссылка)
	                      |	И абс_СвойстваОС.Ссылка <> &Ссылка");
						  
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, СтруктураРеквизитов);
		Объект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДеревоСвойств(ОС, ГруппаОС, ВидОбъектаНедвижимости) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_РеестрОС_Значения.Значение,
	                      |	абс_РеестрОС_Значения.Свойство,
	                      |	абс_РеестрОС_Значения.ОС
	                      |ПОМЕСТИТЬ ВТ_ЗначенияСвойства
	                      |ИЗ
	                      |	РегистрСведений.абс_ЗначенияСвойствОС КАК абс_РеестрОС_Значения
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ОС = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	                      |				ТОГДА ЛОЖЬ
	                      |			ИНАЧЕ абс_РеестрОС_Значения.ОС = &ОС
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_СвойстваОС.Ссылка КАК Свойство,
	                      |	ВТ_ЗначенияСвойства.Значение,
	                      |	абс_СвойстваОС.ТипЗначения,
	                      |	ЕСТЬNULL(абс_СвойстваОС.РедактируетсяВТаблице, ЛОЖЬ) КАК РедактируетсяВТаблице,
	                      |	абс_СвойстваОС.ТаблЧасть,
	                      |	абс_СвойстваОС.Наименование,
	                      |	ВТ_ЗначенияСвойства.ОС
	                      |ПОМЕСТИТЬ ВТ_СобранноеДерево
	                      |ИЗ
	                      |	ПланВидовХарактеристик.абс_СвойстваОС КАК абс_СвойстваОС
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСвойства КАК ВТ_ЗначенияСвойства
	                      |		ПО (ВТ_ЗначенияСвойства.Свойство = абс_СвойстваОС.Ссылка)
	                      |ГДЕ
	                      |	(НЕ абс_СвойстваОС.ЭтоГруппа)
	                      |	И (НЕ абс_СвойстваОС.ПометкаУдаления)"  
						  	+ ПолучитьСтруктуруПараметровЗдания(ГруппаОС, ВидОбъектаНедвижимости) +
	                      ";
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(ХранилищеДополнительнойИнформации.Ссылка) КАК КоличествоФайлов,
	                      |	ХранилищеДополнительнойИнформации.Объект,
	                      |	ХранилищеДополнительнойИнформации.абс_СвойствоОС
	                      |ПОМЕСТИТЬ ВТ_ФайлыОС
	                      |ИЗ
	                      |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                      |ГДЕ
	                      |	ХранилищеДополнительнойИнформации.Объект ССЫЛКА Справочник.ОсновныеСредства
	                      | И ХранилищеДополнительнойИнформации.Объект = &ОС
	                      |СГРУППИРОВАТЬ ПО
	                      |	ХранилищеДополнительнойИнформации.Объект,
	                      |	ХранилищеДополнительнойИнформации.абс_СвойствоОС
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_СобранноеДерево.Свойство,
						  |	ВЫБОР
	                      |		КОГДА ВТ_ФайлыОС.КоличествоФайлов ЕСТЬ НЕ NULL 
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК НаличиеФайлов,
	                      |	ВТ_СобранноеДерево.Значение,
	                      |	ВТ_СобранноеДерево.Свойство.ЭтоГруппа КАК ЭтоГруппа,
	                      |	ВТ_СобранноеДерево.ТипЗначения,
	                      |	ВТ_СобранноеДерево.РедактируетсяВТаблице,
	                      |	ВТ_СобранноеДерево.ТаблЧасть,
	                      |	ВТ_СобранноеДерево.Наименование
	                      |ИЗ
	                      |	ВТ_СобранноеДерево КАК ВТ_СобранноеДерево
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФайлыОС КАК ВТ_ФайлыОС
	                      |		ПО  ВТ_СобранноеДерево.Свойство = ВТ_ФайлыОС.абс_СвойствоОС
	                      | УПОРЯДОЧИТЬ ПО
						|Наименование 
						|ИТОГИ
						|	МАКСИМУМ(НаличиеФайлов)
						|ПО
						|	Свойство ТОЛЬКО ИЕРАРХИЯ");
						  
	Запрос.УстановитьПараметр("ОС", ОС);
							  
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	РазвязатьПустыеГруппы(Дерево);
	
	Возврат Дерево;
	
КонецФункции

Процедура ЗаписатьЗначенияСвойствОС(ДеревоСвойств, ОС, ВедетсяРеестр = Истина) Экспорт
	
	Если НЕ ВедетсяРеестр Тогда
		Возврат;
	КонецЕсли;
	
	Если ДеревоСвойств.Строки.Количество() = 0 ИЛИ (НЕ ЗначениеЗаполнено(ОС)) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.абс_ЗначенияСвойствОС.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ОС.Установить(ОС);
	
	РазобратьДерево(НаборЗаписей, ДеревоСвойств, ОС);
			
	НаборЗаписей.Записать();
		

КонецПроцедуры

Функция ВедетсяРеестр(ГруппаОС) Экспорт	
			
	Если ГруппаОС = Перечисления.ГруппыОС.Здания ИЛИ
		ГруппаОС = Перечисления.ГруппыОС.ТранспортныеСредства ИЛИ
		ГруппаОС = Перечисления.ГруппыОС.ЗемельныеУчастки Тогда 
			Возврат Истина;
	КонецЕсли;
		
	Возврат Ложь;	
		
КонецФункции

Функция ХранятсяФайлыДляСвойства(ОС, Свойство) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ХранилищеДополнительнойИнформации.Ссылка
	                      |ИЗ
	                      |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                      |ГДЕ
	                      |	ХранилищеДополнительнойИнформации.Объект = &Объект
	                      |	И ХранилищеДополнительнойИнформации.абс_СвойствоОС В ИЕРАРХИИ(&Свойство)");
						  
	Запрос.УстановитьПараметр("Объект", ОС);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ВключеноВедениеРееестраОС() Экспорт
	
	Возврат Константы.абс_ВестиРеестрОС.Получить(); 
	
КонецФункции

Процедура ПроверитьАмортизацияОС(Объект, Отказ) Экспорт
	
	Если НЕ Константы.абс_ПроверкаСвойствОСПоРеестру.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Дата < Дата(2014, 01, 01) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Сервер Тогда
		Возврат;
	#КонецЕсли
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаОС = Новый ТаблицаЗначений;
	ТаблицаОС.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	ЗаполнитьМассивОСПоДвижениям(ТаблицаОС, Объект.Движения.СтоимостьОС); 
	ЗаполнитьМассивОСПоДвижениям(ТаблицаОС, Объект.Движения.СтоимостьОСБухгалтерскийУчет);
	ЗаполнитьМассивОСПоДвижениям(ТаблицаОС, Объект.Движения.СтоимостьОСНалоговыйУчет);
	
	ТаблицаОСБезСвойств = ВедетсяРеестрДляТЗ(ТаблицаОС);
	
	Если ТаблицаОСБезСвойств.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		РезультатЗаполнения = ОткрытьФормуМодально("ПланВидовХарактеристик.абс_СвойстваОС.Форма.ФормаСпискаОС", Новый Структура("МассивОС",ТаблицаОСБезСвойств));	
		
		Если РезультатЗаполнения = Неопределено Тогда
			Если ВедетсяРеестрДляТЗ(ТаблицаОСБезСвойств).Количество() <> 0 Тогда 
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Отказ = РезультатЗаполнения;
		КонецЕсли;		
	#КонецЕсли

КонецПроцедуры

Функция ВедетсяРеестрДляОС(ОС) Экспорт
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	абс_ЗначенияСвойствОС.ОС
		                      |ИЗ
		                      |	РегистрСведений.абс_ЗначенияСвойствОС КАК абс_ЗначенияСвойствОС
		                      |ГДЕ
		                      |	абс_ЗначенияСвойствОС.Значение <> НЕОПРЕДЕЛЕНО
		                      |	И абс_ЗначенияСвойствОС.Значение <> """"
		                      |	И абс_ЗначенияСвойствОС.Значение <> 0
		                      |	И абс_ЗначенияСвойствОС.Значение <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                      |	И абс_ЗначенияСвойствОС.Значение ЕСТЬ НЕ NULL 
		                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.ЦелиИспользования.ПустаяСсылка)
		                      |	И абс_ЗначенияСвойствОС.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.абс_СвойстваОС.ОстаточнаяСтоимостьДляАрендуемыхОбъектов)
		                      |	И абс_ЗначенияСвойствОС.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.абс_СвойстваОС.ОстаточнаяБалдансоваяСтоимость)
		                      |	И абс_ЗначенияСвойствОС.ОС = &ОС");
						  
	Запрос.УстановитьПараметр("ОС", ОС);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВедетсяРеестрДляТЗ(ТЗ) Экспорт
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат ТЗ;
	КонецЕсли;
	
	//|	И СтоимостьОСНалоговыйУчетОбороты.ОсновноеСредство.ГруппаОС В (ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ТранспортныеСредства), ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки))	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_ЗначенияСвойствОС.ОС
	                      |ПОМЕСТИТЬ ВТ_ОС
	                      |ИЗ
	                      |	РегистрСведений.абс_ЗначенияСвойствОС КАК абс_ЗначенияСвойствОС
	                      |ГДЕ
	                      |	абс_ЗначенияСвойствОС.Значение <> НЕОПРЕДЕЛЕНО
	                      |	И абс_ЗначенияСвойствОС.Значение <> """"
	                      |	И абс_ЗначенияСвойствОС.Значение <> 0
	                      |	И абс_ЗначенияСвойствОС.Значение <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |	И абс_ЗначенияСвойствОС.Значение ЕСТЬ НЕ NULL 
	                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	                      |	И абс_ЗначенияСвойствОС.Значение <> ЗНАЧЕНИЕ(Справочник.ЦелиИспользования.ПустаяСсылка)
	                      |	И абс_ЗначенияСвойствОС.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.абс_СвойстваОС.ОстаточнаяСтоимостьДляАрендуемыхОбъектов)
	                      |	И абс_ЗначенияСвойствОС.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.абс_СвойстваОС.ОстаточнаяБалдансоваяСтоимость)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	абс_ЗначенияСвойствОС.ОС
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ДвиженияБезГруппировки.ОсновноеСредство КАК ОсновноеСредство
	                      |ПОМЕСТИТЬ ВТ_ДвиженияБезГруппировки
	                      |ИЗ
	                      |	&ТЗ КАК ВТ_ДвиженияБезГруппировки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ДвиженияБезГруппировки.ОсновноеСредство
	                      |ПОМЕСТИТЬ ВТ_ДвиженияГруппировка
	                      |ИЗ
	                      |	ВТ_ДвиженияБезГруппировки КАК ВТ_ДвиженияБезГруппировки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ДвиженияБезГруппировки.ОсновноеСредство
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ДвиженияБезГруппировки.ОсновноеСредство КАК ОсновноеСредство
	                      |ИЗ
	                      |	ВТ_ДвиженияБезГруппировки КАК ВТ_ДвиженияБезГруппировки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОС КАК ВТ_ОС
	                      |		ПО ВТ_ДвиженияБезГруппировки.ОсновноеСредство = ВТ_ОС.ОС
	                      |ГДЕ
	                      |	ВТ_ОС.ОС ЕСТЬ NULL 
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ДвиженияБезГруппировки.ОсновноеСредство");
						  
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Процедура ЗаполнитьСтоимостьОС() Экспорт
	
	ОстаточнаяСтоимостьАвтоОбъект	= ПланыВидовХарактеристик.абс_СвойстваОС.ОстаточнаяБалдансоваяСтоимость.ПолучитьОбъект();
	ОстаточнаяСтоимостьАвтоОбъект.Наименование = "Остаточная балансовая стоимость на " + Формат(НачалоГода(ТекущаяДата()), "ДФ=dd.MM.yyyy");
	ОстаточнаяСтоимостьАвтоОбъект.Записать();
	
	ОстаточнаяСтоимостьЗданияОбъект = ПланыВидовХарактеристик.абс_СвойстваОС.ОстаточнаяСтоимостьДляАрендуемыхОбъектов.ПолучитьОбъект();
	ОстаточнаяСтоимостьЗданияОбъект.Наименование = "Остаточная стоимость на " + Формат(НачалоГода(ТекущаяДата()), "ДФ=dd.MM.yyyy");
	ОстаточнаяСтоимостьЗданияОбъект.Записать();	
	
	МассивГруппОС = Новый Массив;
	МассивГруппОС.Добавить(Перечисления.ГруппыОС.Здания);
	МассивГруппОС.Добавить(Перечисления.ГруппыОС.ТранспортныеСредства);
	МассивГруппОС.Добавить(Перечисления.ГруппыОС.ЗемельныеУчастки);
	
    Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
                          |	СтоимостьОСБухгалтерскийУчетОстатки.ОсновноеСредство,
                          |	СтоимостьОСБухгалтерскийУчетОстатки.СтоимостьОстаток,
                          |	СтоимостьОСБухгалтерскийУчетОстатки.АмортизацияОстаток,
                          |	ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.СтоимостьОстаток, 0) - ЕСТЬNULL(СтоимостьОСБухгалтерскийУчетОстатки.АмортизацияОстаток, 0) КАК ТекущаяСтоимость,
                          |	СтоимостьОСБухгалтерскийУчетОстатки.ОсновноеСредство.ГруппаОС КАК ГруппаОС
                          |ИЗ
                          |	РегистрНакопления.СтоимостьОСБухгалтерскийУчет.Остатки(&Период, ОсновноеСредство.ГруппаОС В (&ГруппыОС)) КАК СтоимостьОСБухгалтерскийУчетОстатки");
						  
	Запрос.УстановитьПараметр("Период", Новый Граница(НачалоГода(ТекущаяДата()), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ГруппыОС", МассивГруппОС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		
		НаборЗаписей = РегистрыСведений.абс_ЗначенияСвойствОС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОС.Установить(Выборка.ОсновноеСредство);
		
		стркоаЗаписи = НаборЗаписей.Добавить();
		стркоаЗаписи.ОС = Выборка.ОсновноеСредство;
		
		Если Выборка.ГруппаОС = Перечисления.ГруппыОС.ТранспортныеСредства Тогда 
			НаборЗаписей.Отбор.Свойство.Установить(ОстаточнаяСтоимостьАвтоОбъект.Ссылка);
			стркоаЗаписи.Свойство = ОстаточнаяСтоимостьАвтоОбъект.Ссылка;
		ИначеЕсли Выборка.ГруппаОС = Перечисления.ГруппыОС.Здания 
			ИЛИ Выборка.ГруппаОС = Перечисления.ГруппыОС.ЗемельныеУчастки Тогда
			НаборЗаписей.Отбор.Свойство.Установить(ОстаточнаяСтоимостьЗданияОбъект.Ссылка);
			стркоаЗаписи.Свойство = ОстаточнаяСтоимостьЗданияОбъект.Ссылка;
		КонецЕсли;
		

		стркоаЗаписи.Значение = Выборка.ТекущаяСтоимость;
		НаборЗаписей.Записать();
			
	КонецЦикла;
	
КонецПроцедуры
	
	


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ


Функция ПолучитьСтруктуруПараметровЗдания(ГруппаОС, ВидОбъектаНедвижимости) 
	
	ТекстУсловия = "";	
	
	Если ГруппаОС = Перечисления.ГруппыОС.ТранспортныеСредства Тогда 
		ТекстУсловия = ТекстУсловия + " И абс_СвойстваОС.ТранспортноеСредство ";	
	ИначеЕсли ГруппаОС = Перечисления.ГруппыОС.ЗемельныеУчастки Тогда
		ТекстУсловия = ТекстУсловия + " И абс_СвойстваОС.ЗемельныйУчасток ";	
	ИначеЕсли ГруппаОС = Перечисления.ГруппыОС.Здания И ВидОбъектаНедвижимости = Перечисления.абс_ВидыОбъектовНевижимостиОС.ПустаяСсылка() Тогда
		ТекстУсловия = ТекстУсловия + " И (абс_СвойстваОС.ЗданияЭТЦ ИЛИ абс_СвойстваОС.ЗданияОфисы ИЛИ абс_СвойстваОС.ЗданияГаражи) ";	
	ИначеЕсли ГруппаОС = Перечисления.ГруппыОС.Здания И ВидОбъектаНедвижимости = Перечисления.абс_ВидыОбъектовНевижимостиОС.ЭТЦ Тогда 
		ТекстУсловия = ТекстУсловия + " И абс_СвойстваОС.ЗданияЭТЦ "; 		
	ИначеЕсли ГруппаОС = Перечисления.ГруппыОС.Здания И ВидОбъектаНедвижимости = Перечисления.абс_ВидыОбъектовНевижимостиОС.ОфисныеЗдания Тогда 
		ТекстУсловия = ТекстУсловия + " И абс_СвойстваОС.ЗданияОфисы ";    
	ИначеЕсли ГруппаОС = Перечисления.ГруппыОС.Здания И ВидОбъектаНедвижимости = Перечисления.абс_ВидыОбъектовНевижимостиОС.Гаражи Тогда 
		ТекстУсловия = ТекстУсловия + " И абс_СвойстваОС.ЗданияГаражи ";
	    
	КонецЕсли;
	
	Возврат ТекстУсловия;
	
КонецФункции

Процедура РазвязатьПустыеГруппы(Ветка)
	
	КолвоЭлементов = Ветка.Строки.Количество();
	
	Для ОбратныйИндекс = 1 По КолвоЭлементов Цикл
		строка = Ветка.Строки[КолвоЭлементов - ОбратныйИндекс];  	
		Если ?(ЗначениеЗаполнено(строка.Свойство),строка.Свойство, Неопределено)  = ?(ЗначениеЗаполнено(строка.Родитель), строка.Родитель.Свойство, Неопределено)  Тогда 
			КолвоЭлементовПодчиненных = строка.Строки.Количество();
			Для ОбратныйИндексПодчиненный = 1 По КолвоЭлементовПодчиненных Цикл          
				подчиненнаяСтрока = строка.Строки[КолвоЭлементовПодчиненных - ОбратныйИндексПодчиненный]; 
				НоваяСтрока = Ветка.Строки.Добавить();          
				ЗаполнитьЗначенияСвойств(НоваяСтрока, подчиненнаяСтрока);          
				Строка.Строки.Удалить(подчиненнаяСтрока); 
			КонецЦикла;
			Ветка.Строки.Удалить(строка);
			Продолжить;
		КонецЕсли;
		
		Если строка.Строки.Количество() > 0 Тогда
			РазвязатьПустыеГруппы(строка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазобратьДерево(НаборЗаписей, Ветка, ОС)
	
	Для Каждого строка из Ветка.Строки Цикл
		
		Если НЕ строка.ЭтоГруппа Тогда 
			строкаНабора = НаборЗаписей.Добавить();
			строкаНабора.ОС = ОС;
			ЗаполнитьЗначенияСвойств(строкаНабора,строка);
		КонецЕсли;
		
		Если строка.Строки.Количество() > 0 Тогда 
			РазобратьДерево(НаборЗаписей,строка, ОС);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивОСПоДвижениям(ТаблицаОС, НаборДвижений)
	
	Для Каждого строка из НаборДвижений Цикл 
		ОС = строка.ОсновноеСредство;
		Если ВедетсяРеестр(ОС.ГруппаОС) Тогда 
			строкаТаблицыОС = ТаблицаОС.Добавить();
			строкаТаблицыОС.ОсновноеСредство  = ОС;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
